---
kind: method
id: M:Autodesk.Revit.DB.Lighting.CircleLightShape.#ctor(Autodesk.Revit.DB.Lighting.CircleLightShape)
source: html/7f15fbc7-1700-8c03-fbd3-74dbb45306ff.htm
---
# Autodesk.Revit.DB.Lighting.CircleLightShape.#ctor Method

Creates a copy of the given circle light shape

## Syntax (C#)
```csharp
public CircleLightShape(
	CircleLightShape other
)
```

## Parameters
- **other** (`Autodesk.Revit.DB.Lighting.CircleLightShape`)

## Exceptions
- **Autodesk.Revit.Exceptions.ArgumentNullException** - A non-optional argument was null